; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	image1 - mode
	thermograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star2 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet12)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star2)
	(supports instrument5 image1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon14)
	(supports instrument7 image1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star2)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon9)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(pointing satellite1 Planet16)
	(pointing satellite3 Phenomenon9)
	(pointing satellite4 Phenomenon11)
	(have_image Planet7 image1)
	(have_image Star8 thermograph0)
	(have_image Phenomenon9 image1)
	(have_image Planet10 image1)
	(have_image Phenomenon11 image1)
	(have_image Planet12 thermograph0)
	(have_image Star13 image1)
	(have_image Phenomenon14 thermograph0)
	(have_image Planet15 image1)
	(have_image Planet16 thermograph0)
))

)

; plan
1. (turn_to satellite4 phenomenon11 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 phenomenon11)
   goals met: 1 of 14
2. (turn_to satellite3 phenomenon9 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 phenomenon9)
   goals met: 2 of 14
3. (turn_to satellite1 groundstation5 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 groundstation5)
   goals met: 2 of 14
4. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 14
5. (calibrate satellite1 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 2 of 14
6. (turn_to satellite1 planet10 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet10)
   goals met: 2 of 14
7. (take_image satellite1 planet10 instrument1 image1)
   added: (have_image planet10 image1)
   goals met: 3 of 14
8. (turn_to satellite1 phenomenon9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 14
9. (take_image satellite1 phenomenon9 instrument1 image1)
   added: (have_image phenomenon9 image1)
   goals met: 4 of 14
10. (turn_to satellite1 phenomenon14 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon14)
   goals met: 4 of 14
11. (take_image satellite1 phenomenon14 instrument1 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 5 of 14
12. (turn_to satellite1 phenomenon11 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon11)
   goals met: 5 of 14
13. (turn_to satellite0 groundstation5 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation5)
   goals met: 6 of 14
14. (take_image satellite1 phenomenon11 instrument1 image1)
   added: (have_image phenomenon11 image1)
   goals met: 7 of 14
15. (turn_to satellite1 planet12 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet12)
   goals met: 7 of 14
16. (take_image satellite1 planet12 instrument1 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 8 of 14
17. (turn_to satellite1 planet15 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet15)
   goals met: 8 of 14
18. (take_image satellite1 planet15 instrument1 image1)
   added: (have_image planet15 image1)
   goals met: 9 of 14
19. (turn_to satellite1 planet7 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet7)
   goals met: 9 of 14
20. (take_image satellite1 planet7 instrument1 image1)
   added: (have_image planet7 image1)
   goals met: 10 of 14
21. (turn_to satellite1 star13 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star13)
   goals met: 10 of 14
22. (take_image satellite1 star13 instrument1 image1)
   added: (have_image star13 image1)
   goals met: 11 of 14
23. (turn_to satellite1 star8 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star8)
   goals met: 11 of 14
24. (take_image satellite1 star8 instrument1 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 12 of 14
25. (turn_to satellite1 planet16 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet16)
   goals met: 13 of 14
26. (take_image satellite1 planet16 instrument1 thermograph0)
   added: (have_image planet16 thermograph0)
   goals met: 14 of 14
